package lesson_17_serialization.task_2.sortNums;

public class Sorter {
    /*
     * 1 Создайте программу, которая принимает набор чисел и выводит их
     * в отсортированном виде. В зависимости от аргументов запуска программы
     * данные принимаются от пользователя или читаются из файла, путь, к которому передан в аргументах.
     *
     * * Дополните программу из предыдущего задания.
     * В зависимости от того, какая настройка указана в файле настроек,
     * отсортированный список чисел должен быть выведен в консоль или сохранён
     * в выходной файл. Имя файла должно быть задано в файле настроек.*/


}
