package lesson_12_inner_class.task_1;

public class Main {
    /*
    * 1 Создайте класс библиотечной карточки.
    * В карточке хранятся данные читателя (фамилия, имя, отчество,
    * дата рождения, номер читательского билета, телефон), данные взятых книг
    * (дата, когда книга была взята, название книги, автор, номер экземпляра,
    * ФИО выдавшего книгу сотрудника, отметка о возврате и дата возврата).
    * Используйте вложенные классы Полное имя, Телефон (код страны, номер, добавочный, тип номера).
    2 В отдельном классе создайте метод, который получает на
    * вход набор библиотечных карточек и выбирает книги, которые не
    * вернули в течение 14 дней после взятия. Используйте локальный класс
    * для просроченных книг. Сформируйте строку по списоку просроченных книг
    * с указанием названия, автора, ФИО и телефона читателя. По данному списку
    * библиотекарь обзвонит читателей и напомнит им, что пора вернуть книгу.
    * При желании можно в локальном классе сгенерировать toString() метод.
    *
    * Для класса библиотечной карточки и его методов напишите Javadoc.
    Сгенерируйте документацию.*/
}